---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures
source: html/a93a9fe5-99d7-3d33-90be-77f69dc6984d.htm
---
# BuiltInFailures.SiteImportFailures Properties

A boundary on this surface could not be autodetected. Revit will impose one, but it may be larger than you want.